# **TITANIC SURVIVOR ANALYSIS**

In [1]:
import pandas as pd
import numpy as np

**READING DATA USING PANDAS**

We use pandas read_csv function to read csv file in python and pandas dataframe method to convert file into the dataframe.

In [3]:
df = pd.DataFrame(pd.read_csv('/content/train (1).csv'))
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

We use shape function to see number of rows and columns in file.

In [4]:
df.shape

(891, 12)

**HANDLING NULL VALUES**
The data set may contains many row and columns for which some values are missing, we can't leave those values as it is.In such cases we have two options:


1. Either drop the entire row or column.
2. Fill the missing values with some appropriate value let's say mean of all values for that column may do the job.

In [5]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
Seperating out the column which have more than 35% values missing on the dataset.

In [6]:
drop_col = df.isnull().sum()[df.isnull().sum() > (35/100 * df.shape[0])]
drop_col

Cabin    687
dtype: int64

In [7]:
drop_col.index

Index(['Cabin'], dtype='object')

In [8]:
df.drop(drop_col.index, axis=1 , inplace=True)
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

In [10]:
df.fillna(df.mean(), inplace=True)
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

Beacuse **Embarked** conatins string values, we see details of that column seperately from others as strings does not have mean and all.

In [11]:
df['Embarked'].describe()

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

For, Emabarked attribute, we fill **NULL** values with the most frequent value in the column.

In [15]:
df['Embarked'].fillna('S',inplace=True)
df.isnull().sum()                  #Now , all the values have been filled.

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [16]:
df.corr()

             PassengerId  Survived    Pclass  ...     SibSp     Parch      Fare
PassengerId     1.000000 -0.005007 -0.035144  ... -0.057527 -0.001652  0.012658
Survived       -0.005007  1.000000 -0.338481  ... -0.035322  0.081629  0.257307
Pclass         -0.035144 -0.338481  1.000000  ...  0.083081  0.018443 -0.549500
Age             0.033207 -0.069809 -0.331339  ... -0.232625 -0.179191  0.091566
SibSp          -0.057527 -0.035322  0.083081  ...  1.000000  0.414838  0.159651
Parch          -0.001652  0.081629  0.018443  ...  0.414838  1.000000  0.216225
Fare            0.012658  0.257307 -0.549500  ...  0.159651  0.216225  1.000000

[7 rows x 7 columns]



*   sibsp : Number of siblings/spouses abroad.
*   parch : Number of parents/children abroad.

So, we can make a new column family_size by combining these two columns.

In [27]:
df['Sex'] = [0 if df['Sex'][i]=='male' else 1 for i in df.index]
df.groupby(['Sex'])['Survived'].mean()

Sex
0    0.188908
1    0.742038
Name: Survived, dtype: float64

It shows that female passengers have more chances of surviving than the male one.

It shows that women are prioritized over men.

In [28]:
df.groupby(['Embarked'])['Survived'].mean()

Embarked
C    0.553571
Q    0.389610
S    0.339009
Name: Survived, dtype: float64

# **CONCLUSION**



*   Female passengers are prioritized over men.
*   People with high-class or rich people have higher survival rate than others.
The hierarichy must have been followed while saving the passengers.


*   Passengers travelling with their family have higher survival rate.
*   People who borded the ship at Cherbourg, survived more in proportion then others.